# Sales Data Analysis - EDA

### Load the Data from MySQL
The data is in `sales219.sql` file, loaded into MySQL database `mcda5580`.
We use SQLAlchemy to connect to MySQL with credentials stored in `.env` file.

## 1. Import Libraries

In [7]:
import os
from pathlib import Path
from dotenv import load_dotenv
import pandas as pd
from sqlalchemy import create_engine, text
# import matplotlib
# matplotlib.use("Agg")   # non-GUI backend, safe everywhere

# import matplotlib.pyplot as plt

print("✓ Libraries imported successfully!")

✓ Libraries imported successfully!

## 2. Load Database Configuration

Using environment variables from `.env` file for secure credential management.

In [25]:
# Get project root directory using pathlib
project_root = Path.cwd()
env_path = project_root / '.env'

# Load environment variables from .env file
load_dotenv(dotenv_path=env_path)

# Database connection parameters
DB_HOST = os.getenv('DB_HOST', 'localhost')
DB_PORT = os.getenv('DB_PORT', '3306')
DB_NAME = os.getenv('DB_NAME')
DB_USER = os.getenv('DB_USER')
DB_PASSWORD = os.getenv('DB_PASSWORD')
TABLE_NAME = os.getenv('DB_TABLE', 'sales219')

# Validate configuration
if not all([DB_NAME, DB_USER, DB_PASSWORD]):
    raise ValueError("Missing required environment variables. Check your .env file.")

print("✓ Configuration loaded successfully!")
print(f"  Database: {DB_NAME}")
print(f"  Host: {DB_HOST}:{DB_PORT}")
print(f"  Table: {TABLE_NAME}")
print(f"  User: {DB_USER}")
print(f"  Password: {DB_PASSWORD}")

✓ Configuration loaded successfully!
  Database: text_mining
  Host: localhost:3306
  Table: sales219
  User: jeevan
  Password: password

## 3. Create Database Connection

Using SQLAlchemy engine for database operations.

In [10]:
# Create SQLAlchemy engine
connection_string = f"mysql+mysqldb://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
engine = create_engine(connection_string)
print(f"Connection String: {connection_string}")
# Test connection
try:
    with engine.connect() as conn:
        result = conn.execute(text("SELECT DATABASE()"))
        db_name = result.fetchone()[0]
        print(f"✓ Successfully connected to database: {db_name}")
except Exception as e:
    print(f"✗ Connection failed: {e}")
    raise

Connection String: mysql+mysqldb://jeevan:password@localhost:3306/text_mining
✓ Successfully connected to database: text_mining

## 4. Explore Table Structure

In [11]:
# Get table structure
table_structure_query = f"DESCRIBE {TABLE_NAME}"
table_structure = pd.read_sql(table_structure_query, engine)

print(f"\nTable: {TABLE_NAME}")
print(f"Number of columns: {len(table_structure)}")
print("\nTable Structure:")
display(table_structure)

Table: sales219
Number of columns: 17

Table Structure:

                        Field          Type Null  Key Default Extra
0              TRANSACTION_RK   varchar(10)  YES  MUL    None
1                 CALENDAR_DT    varchar(9)  YES         None
2                        date          date   NO         None
3                        time          time   NO         None
4              TRANSACTION_TM    varchar(8)  YES         None
5                     ITEM_SK   varchar(20)  YES  MUL    None
6   RETAIL_OUTLET_LOCATION_SK           int  YES         None
7             POS_TERMINAL_NO           int  YES         None
8                  CASHIER_NO           int  YES         None
9                    ITEM_QTY           int  YES         None
10                ITEM_WEIGHT  decimal(4,3)  YES         None
11               SALES_UOM_CD    varchar(1)  YES         None
12         SELLING_RETAIL_AMT  decimal(6,5)  YES         None
13         PROMO_SALES_IND_CD    varchar(1)  YES         None
14            STAPLE_ITEM_FLG    varchar(1)  YES         None
15                  REGION_CD           int  YES         None
16                CUSTOMER_SK   varchar(20)  YES  MUL    None

In [12]:
# Check total number of rows
count_query = f"SELECT COUNT(*) as total_rows FROM {TABLE_NAME}"
row_count = pd.read_sql(count_query, engine)
total_rows = row_count['total_rows'].iloc[0]

print(f"\nTotal rows in {TABLE_NAME}: {total_rows:,}")

Total rows in sales219: 3,678,038

## 5. Load Sample Data

Load a sample of the data for quick exploration.

In [13]:
# Load sample data (first 1000 rows)
sample_query = f"SELECT * FROM {TABLE_NAME} LIMIT 1000"
df_sample = pd.read_sql(sample_query, engine)

print(f"✓ Sample data loaded: {len(df_sample):,} rows")
print(f"  Shape: {df_sample.shape}")
print(f"  Columns: {list(df_sample.columns)}")

✓ Sample data loaded: 1,000 rows
  Shape: (1000, 17)
  Columns: ['TRANSACTION_RK', 'CALENDAR_DT', 'date', 'time', 'TRANSACTION_TM', 'ITEM_SK', 'RETAIL_OUTLET_LOCATION_SK', 'POS_TERMINAL_NO', 'CASHIER_NO', 'ITEM_QTY', 'ITEM_WEIGHT', 'SALES_UOM_CD', 'SELLING_RETAIL_AMT', 'PROMO_SALES_IND_CD', 'STAPLE_ITEM_FLG', 'REGION_CD', 'CUSTOMER_SK']

In [14]:
# Display first few rows
print("\nFirst 10 rows:")
display(df_sample.head(10))

First 10 rows:

,TRANSACTION_RK,CALENDAR_DT,date,time,TRANSACTION_TM,ITEM_SK,RETAIL_OUTLET_LOCATION_SK,POS_TERMINAL_NO,CASHIER_NO,ITEM_QTY,ITEM_WEIGHT,SALES_UOM_CD,SELLING_RETAIL_AMT,PROMO_SALES_IND_CD,STAPLE_ITEM_FLG,REGION_CD,CUSTOMER_SK
0,6711099404,01JAN2015,2015-01-01,0 days 22:51:50,22:51:50,12519213,219,7,116,1,0.000,U,6.99,R,Y,4,1
1,6712905826,02JAN2015,2015-01-02,0 days 14:10:33,14:10:33,11838638,219,6,260,1,0.000,U,3.09,R,Y,4,1
2,6712906309,02JAN2015,2015-01-02,0 days 16:48:32,16:48:32,11627223,219,9,212,1,0.000,U,5.49,R,N,4,1
3,6712907445,02JAN2015,2015-01-02,0 days 20:01:05,20:01:05,11840452,219,6,132,1,0.000,U,1.25,N,N,4,1
4,6712905166,02JAN2015,2015-01-02,0 days 07:38:03,7:38:03,14199100,219,6,121,1,0.000,N,4.99,R,N,4,1
5,6712905272,02JAN2015,2015-01-02,0 days 09:45:04,9:45:04,11603101,219,30,143,1,0.000,U,1.00,N,N,4,1
6,6712905272,02JAN2015,2015-01-02,0 days 09:45:04,9:45:04,11680016,219,30,143,1,0.000,U,4.00,N,N,4,1
7,6712905323,02JAN2015,2015-01-02,0 days 10:17:40,10:17:40,11680016,219,30,143,1,0.000,U,1.00,N,N,4,1
8,6712905334,02JAN2015,2015-01-02,0 days 10:32:08,10:32:08,11672436,219,9,169,1,0.000,U,4.09,R,Y,4,1
9,6712905334,02JAN2015,2015-01-02,0 days 10:32:08,10:32:08,11699016,219,9,169,1,0.296,N,1.63,R,N,4,1

## 6. Basic Exploratory Data Analysis

In [15]:
# Dataset information
print("\nDataset Information:")
df_sample.info()

Dataset Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 17 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   TRANSACTION_RK             1000 non-null   object
 1   CALENDAR_DT                1000 non-null   object
 2   date                       1000 non-null   object
 3   time                       1000 non-null   timedelta64[ns]
 4   TRANSACTION_TM             1000 non-null   object
 5   ITEM_SK                    1000 non-null   object
 6   RETAIL_OUTLET_LOCATION_SK  1000 non-null   int64
 7   POS_TERMINAL_NO            1000 non-null   int64
 8   CASHIER_NO                 1000 non-null   int64
 9   ITEM_QTY                   1000 non-null   int64
 10  ITEM_WEIGHT                1000 non-null   float64
 11  SALES_UOM_CD               1000 non-null   object
 12  SELLING_RETAIL_AMT         1000 non-null   float64
 13  PROMO_SALES_IND_CD         1000 non-null   object
 14  STAPLE_ITEM_FLG            1000 non-null   object
 15  REGION_CD                  1000 non-null   int64
 16  CUSTOMER_SK                1000 non-null   object
dtypes: float64(2), int64(5), object(9), timedelta64[ns](1)
memory usage: 132.9+ KB

In [16]:
# Statistical summary
print("\nStatistical Summary:")
display(df_sample.describe())

Statistical Summary:

,time,RETAIL_OUTLET_LOCATION_SK,POS_TERMINAL_NO,CASHIER_NO,ITEM_QTY,ITEM_WEIGHT,SELLING_RETAIL_AMT,REGION_CD
count,1000,1000.0,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.0
mean,0 days 15:09:14.644000,219.0,8.092000,153.261000,1.130000,0.115095,3.889239,4.0
std,0 days 03:46:15.230833892,0.0,6.701227,62.613156,0.579168,0.446442,2.519830,0.0
min,0 days 06:13:01,219.0,3.000000,104.000000,0.000000,0.000000,-9.999990,4.0
25%,0 days 11:50:36,219.0,6.000000,120.000000,1.000000,0.000000,2.290000,4.0
50%,0 days 15:20:37,219.0,6.000000,128.000000,1.000000,0.000000,3.290000,4.0
75%,0 days 18:08:05,219.0,7.000000,169.000000,1.000000,0.000000,4.990000,4.0
max,0 days 23:35:39,219.0,40.000000,712.000000,8.000000,5.975000,9.999990,4.0

In [17]:
# Check for missing values
print("\nMissing Values Analysis:")
missing_data = df_sample.isnull().sum()
missing_percent = (missing_data / len(df_sample)) * 100
missing_df = pd.DataFrame({
    'Missing Count': missing_data,
    'Percentage': missing_percent
})

# Show only columns with missing values
missing_cols = missing_df[missing_df['Missing Count'] > 0]
if len(missing_cols) > 0:
    display(missing_cols)
else:
    print("✓ No missing values found!")

Missing Values Analysis:
✓ No missing values found!

## 7. Load Full Dataset (Optional)

Uncomment and run to load the complete dataset if needed.

In [18]:
# Uncomment to load full dataset
# WARNING: This may take time and use significant memory

full_query = f"SELECT * FROM {TABLE_NAME}"
df_full = pd.read_sql(full_query, engine)
print(f"\n✓ Full dataset loaded: {len(df_full):,} rows")
print(f"  Memory usage: {df_full.memory_usage(deep=True).sum() / 1024**2:.2f} MB")

✓ Full dataset loaded: 3,678,038 rows
  Memory usage: 1891.95 MB

## 9. Data Visualization

Add your visualizations here based on the actual columns in your dataset.

In [38]:
load_dotenv(dotenv_path=env_path)
import matplotlib

ValueError: Key backend: 'module://matplotlib_inline.backend_inline' is not a valid value for backend; supported values are ['gtk3agg', 'gtk3cairo', 'gtk4agg', 'gtk4cairo', 'macosx', 'nbagg', 'notebook', 'qtagg', 'qtcairo', 'qt5agg', 'qt5cairo', 'tkagg', 'tkcairo', 'webagg', 'wx', 'wxagg', 'wxcairo', 'agg', 'cairo', 'pdf', 'pgf', 'ps', 'svg', 'template']

In [ ]:
# Example visualization - modify based on your actual columns
# Uncomment and adjust column names as needed



plt.figure(figsize=(12, 6))
df_sample['your_column'].value_counts().head(10).plot(kind='bar')
plt.title('Top 10 Values')
plt.xlabel('Category')
plt.ylabel('Count')
plt.xticks(rotation=45)
plt.tight_layout()
plt.show()

SyntaxError: invalid syntax (3594212782.py, line 5)

## 10. Cleanup

Close database connection when done.

In [ ]:
# Close the database connection
engine.dispose()
print("✓ Database connection closed")